[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=1
width = 320
height = 320
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

#learning_rate=0.00261
learning_rate=0.00391
burn_in=1000

max_batches = 340000
policy=steps
steps=240000, 270000
scales=.1,.1

#weights_reject_freq=1001
#ema_alpha=0.9998
#equidistant_point=1000
#num_sigmas_reject_badlabels=3
#badlabels_rejection_percentage=0.2

#0
[convolutional]
batch_normalize=1
filters=8
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=8
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#1
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

#2
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

#3
[maxpool]
size=2
stride=2

#4
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#5
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#6
[maxpool]
size=2
stride=2

#7
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

#8
[route]
layers=-1
groups=2
group_id=1

#9
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#10
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#11
[route]
layers=-1, -2

#12
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#13
[route]
layers=-6, -1

#14
[maxpool]
size=2
stride=2

#15
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#16
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#17
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

##################################

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask = 3,4,5
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
anchors =  28, 55,  51,129, 122,147,  83,238, 155,274, 252,288
classes=3
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
#new_coords=1
#scale_x_y = 2.0

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 12

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask = 1,2,3
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
anchors =  28, 55,  51,129, 122,147,  83,238, 155,274, 252,288
classes=3
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
resize=1.5
nms_kind=greedynms
beta_nms=0.6
#new_coords=1
#scale_x_y = 2.0
